bitly_rails_old/app/controllers/urls_controller.rb

  def index
    @urls = Url.all
---
SELECT "urls".* FROM "urls"

  def show
    @url = Url.find(params[:id])
---
SELECT  "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @url = Url.new(url_params)

    if @url.save
---
INSERT INTO "urls" ("original_url", "short_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["original_url", "http://www.google.com"], ["short_url", "http://www.sho.rt/PvYjNn"], ["created_at", 2017-03-09 00:42:09 UTC], ["updated_at", 2017-03-09 00:42:09 UTC]]